changing chart to mermaid flowchart
